In [48]:
%matplotlib inline
import pandas as pd

from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [49]:
import numpy as np
import warnings
warnings.filterwarnings("ignore")
import os
os.chdir("C:/Users/Abhishek/Desktop/Data Sets/Movies")

In [50]:
titles = pd.read_csv('titles.csv')
titles.head(3)

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970

In [51]:
cast = pd.read_csv('cast.csv')
cast.head(3)

                 title  year      name   type        character     n
0       Closet Monster  2015  Buffy #1  actor          Buffy 4  31.0
1      Suuri illusioni  1985    Homo $  actor           Guests  22.0
2  Battle of the Sexes  2017   $hutter  actor  Bobby Riggs Fan  10.0

In [52]:
release_dates = pd.read_csv('release_dates.csv')
release_dates.head(3)

                   title  year   country        date
0  #73, Shaanthi Nivaasa  2007     India  2007-06-15
1                  #BKKY  2016  Cambodia  2017-10-12
2                #Beings  2015   Romania  2015-01-29

In [53]:
data=pd.DataFrame(titles)
data_cast=pd.DataFrame(cast)

### How many movies are listed in the titles dataframe?

In [54]:
print("Movies in the titles dataframe are : ",len(data.title))

Movies in the titles dataframe are :  244914

### What are the earliest two films listed in the titles dataframe?

In [55]:
print("the earliest two films are : ")
data.sort_values(by="year").head(2)

the earliest two films are :

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [56]:
print(len(data[data.title=="Hamlet"])," Movies named Hamlet")

20  Movies named Hamlet

### How many movies are titled "North by Northwest"?

In [57]:
print(len(data[data.title=="North by Northwest"]),"Movies named North by Northwest")

1 Movies named North by Northwest

### When was the first movie titled "Hamlet" made?

In [58]:
data[data.title=="Hamlet"].sort_values(by="year").head(1)
print(" Year 1910")

 Year 1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [59]:
data[data.title=="Treasure Island"].sort_values(by="year")

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [60]:
len(data[data.year==1950])

1113

### How many movies were made in the year 1960?

In [61]:
len(data[data.year==1960])

1549

### How many movies were made from 1950 through 1959?

In [62]:
len(data[data["year"] >=1950][data["year"]<=1959]  )

12934

### In what years has a movie titled "Batman" been released?

In [63]:
data[data.title=="Batman"]

         title  year
39349   Batman  1943
240896  Batman  1989

In [64]:
print("Year 1943 and 1989")

Year 1943 and 1989

### How many roles were there in the movie "Inception"?

In [65]:
len(data_cast[data_cast["title"]=="Inception"][data_cast["character"].isnull()==False])

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [66]:
len(data_cast[data_cast["title"]=="Inception"][data_cast["n"].isnull()])

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [67]:
len(data_cast[data_cast["title"]=="Inception"][data_cast["n"].isnull()==False])

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [68]:
data_cast[data_cast["title"]=="North by Northwest"][data_cast["n"].isnull()==False].sort_values(by="n")

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
3048272,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1695173,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1275337,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2447081,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1811387,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2295714,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1508344,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1384780,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [69]:
data_cast[data_cast["title"]=="Sleuth"][data_cast["year"]==1972].sort_values(by="n")

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [70]:
data_cast[data_cast["title"]=="Sleuth"][data_cast["year"]==2007].sort_values(by="n")

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [71]:
len(data_cast[data_cast["title"]=="Hamlet"][data_cast["year"]==1921])

9

### How many roles were credited in Branaghâ€™s 1996 Hamlet?

In [72]:
len(data_cast[data_cast["title"]=="Hamlet"][data_cast["year"]==1996])

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [73]:
len(data_cast[data_cast["title"]=="Hamlet"])

342

### How many people have played an "Ophelia"?

In [74]:
len(data_cast[data_cast["character"]=="Ophelia"])

117

### How many people have played a role called "The Dude"?

In [75]:
len(data_cast[data_cast["character"]=="The Dude"])

19

### How many people have played a role called "The Stranger"?

In [76]:
len(data_cast[data_cast["character"]=="The Stranger"])

212

### How many roles has Sidney Poitier played throughout his career?

In [77]:
len(data_cast[data_cast["name"]=="Sidney Poitier"])

43

### How many roles has Judi Dench played?

In [78]:
len(data_cast[data_cast["name"]=="Judi Dench"])

55

In [79]:
data_cast.head(1)

            title  year      name   type character     n
0  Closet Monster  2015  Buffy #1  actor   Buffy 4  31.0

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [80]:
# Which column is Supporting roles??

In [81]:
data_cast["type"].unique()

array(['actor', 'actress'], dtype=object)

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [82]:
# Which column is Leading roles??

### How many roles were available for actors in the 1950s?

In [83]:
len(data_cast[data_cast["type"]=='actor'][data_cast["year"]>=1950][data_cast["year"]<1960])

157738

### How many roles were available for actresses in the 1950s?

In [84]:
len(data_cast[data_cast["type"]=='actress'][data_cast["year"]>=1950][data_cast["year"]<1960])

57733

### How many leading roles (n=1) were available from the beginning of film history through 1980?

### How many non-leading roles were available through from the beginning of film history through 1980?

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [85]:
len(data_cast[data_cast["year"]>=1980][data_cast["year"]<1990] [data_cast["n"].isnull()])

53028